# Setting up a Flask App

### Introduction

In this lesson, we'll practice setting up a flask application from scratch.  To do so we'll use the imdb database from before.

### Seeing the films database

We can begin by loading our data from the `films.db` database with SQLite3.

In [1]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('films.db')

From there, we can look at the various tables we have available to us.

In [2]:
cursor = conn.cursor()

cursor.execute('SELECT name from sqlite_master where type= "table"')

In [3]:
cursor.fetchall()

[('actors',),
 ('directors',),
 ('writers',),
 ('movies',),
 ('movie_actors',),
 ('movie_directors',),
 ('movie_writers',)]

And we can explore any one of those tables, with something like the following.

In [5]:
import pandas as pd

pd.read_sql('select * from actors limit 2;', conn)

   id             name
0   1   Brendan Fraser
1   2  Brett Granstaff

In [6]:
pd.read_sql('select * from movies limit 2;', conn)

,id,title,studio,runtime,description,release_date,year
0,11784,!Women Art Revolution,Zeitgeist Films,83.0,"Through intimate interviews, art, and rarely s...",2011-06-01 00:00:00,2011
1,21806,#Horror,Lowland Pictures,90.0,You've got followers... Cyberbullying goes off...,2015-11-20 00:00:00,2015

Build out a flask api for both the `movies` and `actors` resources.  Each resource should only have two routes.  One endpoint should be for the `index` page (where all members of the resource is returned), and another endpoint should be for the `show` resource -- where an id of an entry is provided and the related member is returned.

We should follow the model, view, controller pattern with all resources.  And create a folder called `src` to place all of the code -- if you would like to create additional subfolders, that's also ok.